public_html/Misc/Train/projecteuler.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Project Euler</title>
<!-- 2014-01-02 Thu 22:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Project Euler</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Answer</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Answer</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://projecteuler.net/">http://projecteuler.net/</a>
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">1</span>
<span style="color: #b0c4de;">sum</span> = 0
<span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(1,1000):
    <span style="color: #00ffff;">if</span> i % 3 == 0 <span style="color: #00ffff;">or</span> i % 5 == 0:
        <span style="color: #b0c4de;">sum</span> += i
<span style="color: #b0c4de;">print</span> sum

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">--------------</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">sum = (s+e)*n/2=(d + d*int(x/d)) * int(x/d) /2</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">sum = d * int(x/d) * (1 + int(x/d)) / 2</span>
<span style="color: #b0c4de;">sum</span> = 3*<span style="color: #b0c4de;">int</span>(999/3)*(1+<span style="color: #b0c4de;">int</span>(999/3))/2 + 
5*<span style="color: #b0c4de;">int</span>(999/5)*(1+<span style="color: #b0c4de;">int</span>(999/5))/2 - 
15*<span style="color: #b0c4de;">int</span>(999/15)*(1+<span style="color: #b0c4de;">int</span>(999/15))/2

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">2</span>
<span style="color: #b0c4de;">sum</span> = 0
a = 1
b = 2
<span style="color: #00ffff;">while</span> b &lt; 4e6:
    <span style="color: #00ffff;">if</span> b % 2 == 0:
        <span style="color: #b0c4de;">sum</span> += b
    <span style="color: #b0c4de;">next</span> = a + b
    a = b
    b = <span style="color: #b0c4de;">next</span>

<span style="color: #b0c4de;">print</span> sum
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">--------------</span>
<span style="color: #ffa07a;">'''</span>
<span style="color: #ffa07a;">The Fibonacci series is:</span>
<span style="color: #ffa07a;">1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610...</span>
<span style="color: #ffa07a;">Now, replacing an odd number with O and an even with E, we get:</span>
<span style="color: #ffa07a;">O, O, E, O, O, E, O, O, E, O, O, E, O, O, E...</span>
<span style="color: #ffa07a;">And so each third number is even.  We don't need to calculate the odd numbers.</span>
<span style="color: #ffa07a;">Starting from an two odd terms x, y, the series is:</span>
<span style="color: #ffa07a;">x, y, x + y, x + 2y, 2x + 3y, 3x + 5y</span>
<span style="color: #ffa07a;">'''</span>
x = y = 1
<span style="color: #b0c4de;">sum</span> = 0
<span style="color: #00ffff;">while</span> ((x + y) &lt; 4e6):
    <span style="color: #b0c4de;">sum</span> += (x + y)
    x, y = x + 2 * y, 2 * x + 3 * y
    <span style="color: #b0c4de;">print</span>  x,y
<span style="color: #b0c4de;">print</span> sum

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">3</span>
<span style="color: #00ffff;">import</span> math
<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">isprime</span>(num, primelist):
    <span style="color: #ffebcd; background-color: #2f4f4f;">num_sqrt</span> = math.sqrt(num)
    <span style="color: #00ffff;">for</span> prime <span style="color: #00ffff;">in</span> primelist:
        <span style="color: #00ffff;">if</span> num % prime == 0:
            <span style="color: #00ffff;">return</span> 0
        <span style="color: #00ffff;">if</span> prime &gt; num_sqrt:
            <span style="color: #00ffff;">break</span>
    <span style="color: #00ffff;">return</span> 1

<span style="color: #ffebcd; background-color: #2f4f4f;">primelist</span> = []
primelist.append(2)
<span style="color: #ffebcd; background-color: #2f4f4f;">lim</span> = 600851475143
i = 3
<span style="color: #ffebcd; background-color: #2f4f4f;">ret</span> = []
<span style="color: #00ffff;">while</span> i &lt; lim:
    <span style="color: #00ffff;">if</span> isprime(i, primelist):
        primelist.append(i)
        <span style="color: #00ffff;">while</span> lim % i == 0:
            <span style="color: #ffebcd; background-color: #2f4f4f;">lim</span> = lim / i
            ret.append(i)
    i += 2

ret.append(lim)
<span style="color: #b0c4de;">print</span> max(ret)

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">4</span>
<span style="color: #00ffff;">import</span> sys
<span style="color: #00ffff;">for</span> upnum <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(999, 99, -1):
    <span style="color: #ffebcd; background-color: #2f4f4f;">str_num</span> = <span style="color: #b0c4de;">str</span>(upnum) + <span style="color: #b0c4de;">str</span>(upnum)[::-1]
    <span style="color: #00ffff;">for</span> div <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(100, 1000):
        <span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">int</span>(str_num) % div == 0:
            <span style="color: #ffebcd; background-color: #2f4f4f;">res</span> = <span style="color: #b0c4de;">int</span>(str_num) / div
            <span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">len</span>(str(res)) == 3:
                <span style="color: #b0c4de;">print</span> str_num
                sys.exit(0)

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">5</span>
<span style="color: #ffebcd; background-color: #2f4f4f;">ret_factor</span> = []

<span style="color: #ffebcd; background-color: #2f4f4f;">ret</span> = 2
ret_factor.append(2)

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">get_factor</span>(num, factors):
    <span style="color: #ffebcd; background-color: #2f4f4f;">ret</span> = num
    <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> factors:
        <span style="color: #00ffff;">if</span> ret % i == 0:
            <span style="color: #ffebcd; background-color: #2f4f4f;">ret</span> /= i
    <span style="color: #00ffff;">return</span> ret

<span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(3, 20):
    <span style="color: #00ffff;">if</span> ret % i:
        <span style="color: #ffebcd; background-color: #2f4f4f;">new_factor</span> = get_factor(i, ret_factor)
        ret_factor.append(new_factor)
        <span style="color: #ffebcd; background-color: #2f4f4f;">ret</span> *= new_factor
<span style="color: #b0c4de;">print</span> ret

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">6</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">squre_sum = n(n+1)(2n+1)/6</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">sum = (1+n)*n/2</span>
<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">diff_num</span>(n):
    <span style="color: #b0c4de;">sum</span> = (1+n)*n/2
    <span style="color: #ffebcd; background-color: #2f4f4f;">squre_sum</span> = n*(n+1)*(2*n+1)/6
    <span style="color: #00ffff;">return</span> sum**2 - squre_sum

<span style="color: #b0c4de;">print</span> diff_num(100)

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">7</span>
<span style="color: #00ffff;">import</span> math
<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">isprime</span>(num, primelist):
    <span style="color: #ffebcd; background-color: #2f4f4f;">num_sqrt</span> = math.sqrt(num)
    <span style="color: #00ffff;">for</span> prime <span style="color: #00ffff;">in</span> primelist:
        <span style="color: #00ffff;">if</span> num % prime == 0:
            <span style="color: #00ffff;">return</span> 0
        <span style="color: #00ffff;">if</span> prime &gt; num_sqrt:
            <span style="color: #00ffff;">break</span>
    <span style="color: #00ffff;">return</span> 1

<span style="color: #ffebcd; background-color: #2f4f4f;">primelist</span> = []
primelist.append(2)

i = 1
<span style="color: #ffebcd; background-color: #2f4f4f;">number</span> = 3
<span style="color: #00ffff;">while</span> i &lt; 10001:
    <span style="color: #00ffff;">if</span> isprime(number, primelist):
        primelist.append(number)
        i += 1
    <span style="color: #ffebcd; background-color: #2f4f4f;">number</span> += 2
<span style="color: #b0c4de;">print</span> primelist[-1]
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2014-01-02 Thu 22:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.3a)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
